{
    "locales": {
        "en": {
            "title": "Experience",
            "title_long_prefix": "Summary of my",
            "title_long": "**Work** Experience"
        }
    },

    "articles": [
        {
            "id": "work",
            "component": "ArticleTimeline",
            "config": {},
            "locales": {},

            "items": [
                {
                    "icon": {
                        "img": "images/pictures/vnova.jpg",
                        "fa": "",
                        "faColors": {"bg": null, "fill": null}
                    },
                    "dates": {
                        "start": "06/01/2024",
                        "end": "now"
                    },
                    "locales": {
                        "en": {
                            "title": "**Integration** Engineer",
                            "info": "V-Nova Ltd",
                            "text": "<ul><li>Worked closely with customers and internal teams to define technical requirements, contributing to the creation of detailed project charters for codec integration projects.</li><li>Developed and maintained Bash and Python scripts to automate codec performance benchmarking, regression testing, and deployment processes, reducing manual testing time by 10%.</li><li>Designed and implemented automated validation frameworks, improving test coverage and ensuring compliance with industry standards such as MPEG-5 LCEVC.</li><li>Optimized codec integration with media processing pipelines, reducing latency by 20% and enhancing compatibility with video streaming platforms.</li><li>Customized and fine-tuned codec solutions for clients, addressing specific performance constraints and achieving up to 30% efficiency gains in compression and playback quality.</li></ul>",
                            "tags": ["Java", "Codec", "FFmpeg", "C/C++", "Bash", "Charters"]
                        }
                    }
                },
                {
                    "icon": {
                        "img": "images/pictures/innvotek_logo.jpg",
                        "fa": "",
                        "faColors": {"bg": null, "fill": null}
                    },
                    "dates": {
                        "start": "03/01/2022",
                        "end": "06/01/2023"
                    },
                    "locales": {
                        "en": {
                            "title": "**Software** Engineer",
                            "info": "Innvotek",
                            "text": "<ul><li>Designed and implemented a simulation framework in ROS and Gazebo to generate synthetic sensor data, enabling extensive testing of navigation algorithms without physical hardware.</li><li>Optimized visual-inertial odometry and loop closure detection, reducing cumulative drift and enhancing long-term mapping stability.</li><li>Implemented deep learning-based object detection and multi-target tracking using OpenCV and TensorFlow, improving obstacle avoidance and path planning efficiency.</li><li>Developed and optimized SLAM algorithms using C++ and Python, improving real-time robotic navigation and reducing localization errors by 25%.</li></ul>",
                            "tags": ["C++", "Machine Learning", "SLAM"]
                        }
                    }
                },
                {
                    "icon": {
                        "img": "images/pictures/crocus_cress.jpg",
                        "fa": "",
                        "faColors": {"bg": null, "fill": null}
                    },
                    "dates": {
                        "start": "06/01/2021",
                        "end": "12/01/2023"
                    },
                    "locales": {
                        "en": {
                            "title": "**Data Engineer** Engineer",
                            "info": "Crocus & Cress",
                            "text": "<ul><li>Designed and optimized SQL databases to store and manage case data, improving query performance and retrieval speed by 15%.</li><li>Built and maintained ETL pipelines using SQL and Python, enabling the collection and transformation of abuse reports from multiple sources, including online surveys and helpline records.</li><li>Developed interactive dashboards in Tableau to visualize key metrics such as case trends, geographical distribution, and response times, aiding stakeholders in resource allocation.</li></ul>",
                            "tags": ["MySQL", "Databse", "Tableau"]
                        }
                    }
                },
                {
                    "icon": {
                        "img": "images/pictures/sidmach.jpg",
                        "fa": "",
                        "faColors": {"bg": null, "fill": null}
                    },
                    "dates": {
                        "start": "12/01/2018",
                        "end": "11/01/2019"
                    },
                    "locales": {
                        "en": {
                            "title": "**Software** Developer",
                            "info": "Sidmach",
                            "text": "<ul><li>Designed and maintained MySQL databases for web applications, optimizing queries and indexing to improve performance by 5%.</li><li>Developed and styled responsive web pages using HTML and CSS, ensuring cross-browser compatibility and accessibility compliance.</li><li>Assisted in back-end database management, writing complex SQL queries for data retrieval, updates, and report generation.</li><li>Debugged and resolved database and UI-related issues, improving website stability and user experience.</li></ul>",
                            "tags": ["Java", "AWS", "REST", "Docker"]
                        }
                    }
                },
                {
                    "icon": {
                        "img": null,
                        "fa": "fa-solid fa-building",
                        "faColors": {"bg": null, "fill": null}
                    },
                    "dates": {
                        "start": "12/01/2022",
                        "end": "now"
                    },
                    "locales": {
                        "en": {
                            "title": "**Software** Engineer",
                            "info": "Freelance",
                            "text": "<ul><li>Developed a nutrition-tracking web app using React, implementing features for meal logging, macro tracking, and interactive data visualization.</li><li>Built a car listing platform with React, integrating search filters, image uploads, and user authentication to enhance the buying and selling experience.</li><li>Designed and optimized ETL pipelines in Python and SQL to process large datasets, ensuring efficient data transformation and storage for client applications.</li><li>Created a food ordering system with a MySQL database, enabling real-time order tracking, inventory management, and reporting functionalities.</li></ul>",
                            "tags": ["AWS", "MySQL", "React", "Tableau"]
                        }
                    }
                }
            ]
        }
    ]
}
